class Strings {
  static const test = '''
הסבר קצר על המבנה:
את הכלים להתמודדות עם לחץ וחרדה אחלק לפי 3 חלקים:
גוף(פיזולוגי)
מחשבה (mind)
רגש
במצבי לחץ 3 החלקים פועלים בו זמנית ומשפיעים אחד על השני.
לכל חלק ניתן התייחסות אחרת על מנת להתמודד באופן יעיל עם לחץ וחרדה.

כאשר המוח מזהה מצב מסוכן הוא מחפש דרכים להתמודד ולפתור את המצב המסוכן. מנסה להבין וקרוא את המצב ומפריש הורמון הנקרא קורטיזון (הורמון הלחץ) על מנת שהגוף הפיזי יהיה מוכן גם הוא להתמודד עם המצב. 
התגובה האוטומטית של המוח בזמן סכנה הוא תקיפה, בריחה או קיפאון החלק התחתון במוח (גזע המוח) אחראי בין השאר על תגובה זו. 
במידה ואין סכנה אמיתית והלחץ נובע מתוך פרשנות של המוח את המצב כסכנה אנחנו נרצה להרגיע את המוח ואת הגוף ולהחזירם למצב שגרה.
כלים להתמודדות מבחינה גופנית פיזיולוגית:
אנו נרצה לשדר למוח שהמצב רגוע ואין עוד צורך בהורמון הלחץ. שלמעשה אין באמת סכנה. אציג מספר תרגילים שמצאתי שעובדים באופן מאוד יעיל על אנשים שונים, ככה שכל אחד יבדוק על עצמו איזה מהתרגילים עובד עבורו בצורה הטובה ביותר ויתרגל אותם ביום יום גם כאשר אין מצב לחץ על מנת שהכלי יהפוך להיות שלו בזמן לחץ. קשה באימונים קל בקרב.  
  ''';
}
