Repository: TomerNoy/self-help
Catalog: lib/l10n/app_*.arb
Languages: he

# welcomeTitle
source: Welcome to Self Help!
he: ברוכים הבאים לSelf Help!

source: Login
he: התחברות

# welcomeSubtitle
source: Self-help protocol for dealing with stress and anxiety
he: פרוטוקול עזרה עצמית להתמודדות עם לחץ וחרדה

# welcomeButtonTitle
source: Enter
he: כניסה

source: Email
he: דואר אלקטרוני

source: Password
he: סיסמה

source: Repeat password
he: חזור על הסיסמה

source: Forgot password?
he: שכחתי סיסמה

source: or
he: או

# dontHaveAccount
source: Don't have an account?
he: אין לך משתמש?

source: Register now
he: הירשם עכשיו

source: Registration
he: הרשמה

source: Register
he: הרשם

source: Registering
he: הרשמה

# name
source: User Name
he: שם משתמש

# welcomeMessage
source: Hello, {name}!
he: היי {name}!

# homeSubtitle
source: The right place for self-treatment in dealing with stress and anxiety
he: המקום הנכון לטיפול באופן עצמאי בהתמודדות עם לחץ וחרדה

source: Guest
he: אורח

# sosMainInfo
source: In the next exercise, we will learn to cope with feelings of stress and anxiety using deep breathing exercises, guided imagery, and body relaxation. Each step helps to release tension and experience inner calm. Dedicate a few minutes to yourself and let the tension dissipate.
he: בתרגיל הבא נלמד להתמודד עם תחושות לחץ וחרדה בעזרת תרגילי נשימות עמוקות, דמיון מודרך והרפיית הגוף. כל שלב עוזר לשחרר מתח ולחוות רוגע פנימי. הקדישו כמה דקות לעצמכם ותנו למתח להתפוגג.

# sosMainTitle
source: Treatment for dealing with stress and anxiety
he: טיפול להתמודדות עם לחץ וחרדה

source: Step 1
he: שלב 1

source: Start exercise
he: התחלת התרגיל

# measureTitle
source: pressure measure
he: מד לחץ

# measureSubtitle
source: Mark the level that best describes how you are feeling right now. This process helps with awareness and the self-soothing process.
he: סמן את הרמה שמתארת הכי טוב את ההרגשה שלך עכשיו.

# homeButtonTitle
source: Home Page
he: דף הבית

# continueButtonTitle
source: Continue
he: המשך

source: Good
he: טוב

source: Ok
he: בסדר

source: Neutral
he: ניטרלי

source: Sad
he: עצוב

source: Anxious
he: חרדה

# enterNumber
source: Repeat the number below
he: כתוב את מספר הטלפון שלך

# enterNumberSubtitle
source: Back to control: This simple action anchors you back in the present and allows you to return to a feeling of calm and control.
he: בחזרה לשליטה: פעולה פשוטה זו מעגנת אותך בחזרה בהווה ומאפשרת לך לחזור לתחושת רוגע ושליטה.

source: Back
he: חזרה

# enterNumberBackwards
source: This time write the number backwards.
he: הפעם כתוב את מספר הטלפון שלך מהסוף להתחלה.

# enterNumberBackwardsSubtitle
source: At this stage, you can calm down even more
he: בשלב זה תוכל להרגע אפילו יותר

# breathingExercise
source: Breathe deeply
he: קח נשימה עמוקה

# breathingExerciseSubtitle
source: Click the button and start a 30-second breathing exercise. Let the animation guide you and feel the tension disappear. Deep breaths will help you relax and focus on the present moment.
he: לחץ על הכפתור ותתחיל בתרגיל נשימה של 30 שניות. תן לאנימציה להוביל אותך ותרגיש איך המתח נעלם. נשימות עמוקות יעזרו לך להירגע ולהתמקד ברגע הנוכחי.

source: Skip
he: לדלג

# breathIn
source: Breathe in
he: הכנס אוויר

# breathOut
source: Breathe out
he: הוצא אוויר

# holdBreath
source: Hold your breath
he: החזק אוויר

# calcExercise
source: Solve the following exercises
he: תרגילי חישוב

# calcExerciseSubtitle
source: Simple math exercise that will help you calm your thoughts and concentrate. The exercises will help you activate the rational part of the brain to reduce stress and regain control
he: בתרגיל הבא נתרגל חישובים פשוטים ומהירים על מנת להפעיל את המוח ולהפנות את המחשבות מהלחץ

# lookAroundExercise
source: Look around
he: התבוננות מסביב

# lookAroundExerciseSubtitle
source: In the next exercise, we will practice looking around and identifying colors and shapes in order to redirect thoughts from stress
he: בתרגיל הבא נתרגל התבוננות מסביב וזיהוי צבעים וצורות על מנת להפנות את המחשבות מהלחץ

source: Colors
he: צבעים

# colorsExamples
source: For example: blue, purple, red, green, etc.
he: לדוגמא: כחול, סגול, אדום, ירוק וכו

source: Textures
he: מרקמים

# texturesExamples
source: For example: wood, glass, plastic, etc.
he: לדוגמא: חלק, קשה, רך, חם וכו

# gainControlLandingTitle
source: Returning to control thought
he: חוזרים לשלוט במחשבה

# gainControlLandingSubtitle
source: After we have lowered the stress level to a state where rational thought has returned, we can manage the thoughts that created stress and anxiety. The physiological responses to stress stem from a perception, belief, or thought that we are in danger when in fact there is no real danger. In this situation, we want to identify the thought that activated the physiological system and check if it is correct.
he: לאחר שהורדנו את רמת הלחץ למצב בו המחשבה הרציונאלית חזרה לתפקד, נוכל לנהל את המחשבות שיצרו אצלינו לחץ וחרדה. התגובות הפיזיולוגיות של הלחץ נובעות מתפישה, אמונה או מחשבה שאנו נמצאים בסכנה כאשר למעשה אין סכנה אמיתית. במצב זה נרצה לזהות את המחשבה שהפעילה את המערכת הפיזיולוגית ולבדוק האם היא נכונה.

source: Step 2
he: שלב 2

# letsContinueButtonTitle
source: Let's continue
he: קדימה ממשיכים

# thoughtReleaseTitle
source: Releasing the thought
he: משחררים את המחשבה

# thoughtReleaseSubtitle
source: Click on the cloud, type the non-positive thought, and then you can send it and release it
he: לחץ על הענן, והקלד את המחשבה הלא חיובית. אחרכך תוכל לשלוח אותה ולהשתחרר ממנה

# addThoughtButtonTitle
source: Add thought
he: הוספת מחשבה

# backToLogging
source: Back to login
he: חזור להתחברות

source: Magic touch
he: מגע הקסם

# magicTouchSubtitle
source: In the exercise before us, we can perform self-relaxation through a hug or touch with breathing. You can choose one of the exercises, or do both as needed
he: בתרגול שלפנינו נוכל לבצע הרגעה עצמית על ידי חיבוק או מגע עם נשימה. אפשר לבחור באחד מהתרגילים, או לעשות את שתיהם במידת הצורך

# calmingTouch
source: Place one hand on your chest and the other hand on your stomach. Focus your attention on the touch between your hands and your body You may notice the warmth that is created there. In addition, focus on the air that enters and exits. This exercise will help you focus your attention and another step in the ability to calm down and return to balance even more. Click start and practice for about 30 seconds.
he: הנח יד על החזה ויד על הבטן. מקד את תשומת הלב במגע בין הידיים לגוף אתה אולי יכול לשים לב לחום שנוצר שם. בנוסף התמקד באוויר שנכנס ויוצא. תקגיל זה יעזור לך למיקוד תשומת הלב ושלב נוסף ביכולת להרגע ולחזור לאיזון אף יותר. לחץ על התחל ותרגל במשך כ-30 שניות.

# butterflyHug
source: Hug yourself tightly and calm your nervous system. Cross your arms over your chest and gently tap your shoulders. A simple and effective exercise for relaxation. Focus on deep breathing and feel the tension melt away.\nPress start and practice for about 30 seconds.
he: חבק את עצמך חזק והרגיע את מערכת העצבים. הצלב את זרועותיך על החזה ותופף בעדינות על כתפיך. תרגיל פשוט ויעיל להרגעה. התמקד בנשימות עמוקות והרגיש איך המתח נעלם. לחץ על התחל ותרגל במשך כ-30 שניות.

source: Language
he: שפה

source: Settings
he: הגדרות

source: Profile
he: פרופיל

source: Home
he: בית

source: End exercise
he: סיום תרגול
